УНФ_ТЕСТ/src/Catalogs/КП_РолеваяАдресация/КП_РолеваяАдресация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КП_РолеваяАдресация</name>
  <attributes>
    <name>РольИсполнителя</name>
    <type>
      <types>CatalogRef.КП_РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойОбъектАдресации</name>
    <type>
      <types>Characteristic.КП_ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныйОбъектАдресации</name>
    <type>
      <types>Characteristic.КП_ОбъектыАдресацииЗадач</types>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/КП_РолеваяАдресация/Forms/ФормаСписка/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Список.РежимВыбора=ЭтаФорма.Параметры.РежимВыбора;

	Если Элементы.Список.РежимВыбора Тогда
		РежимОткрытияОкна=РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	КонецЕсли;
	
	РольИсполнителяОтбор=ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("КП_РолеваяАдресация", "РольИсполнителяОтбор");

	УстановитьОтборПоРоли();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	ЗаписатьНастройкиСервером();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОтборПоРоли()
	
	ТекстЗапроса=ПолучитьТекстЗапроса();
	
	Если ЗначениеЗаполнено(РольИсполнителяОтбор) Тогда
		ТекстЗапроса=ТекстЗапроса+"
		         | И СправочникаДокументооборотРолеваяАдресация.РольИсполнителя=&РольИсполнителя
				 |;";
		Список.ТекстЗапроса=ТекстЗапроса;				 
		Список.Параметры.УстановитьЗначениеПараметра("РольИсполнителя", РольИсполнителяОтбор);
		
	Иначе
		Список.ТекстЗапроса=ТекстЗапроса;
		
	КонецЕсли;
	
	Список.Параметры.УстановитьЗначениеПараметра("ПустаяРоль", Справочники.КП_РолиИсполнителей.ПустаяСсылка());
	
КонецПроцедуры

&НаКлиенте
Процедура РольИсполнителяПриИзменении(Элемент)
	УстановитьОтборПоРоли();
	
КонецПроцедуры

Функция ПолучитьТекстЗапроса()
	ТекстЗапроса="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	СправочникаДокументооборотРолеваяАдресация.Ссылка,
	             |	СправочникаДокументооборотРолеваяАдресация.ПометкаУдаления,
	             |	СправочникаДокументооборотРолеваяАдресация.Предопределенный,
	             |	СправочникаДокументооборотРолеваяАдресация.Код,
	             |	СправочникаДокументооборотРолеваяАдресация.Наименование,
	             |	СправочникаДокументооборотРолеваяАдресация.РольИсполнителя,
	             |	СправочникаДокументооборотРолеваяАдресация.ОсновнойОбъектАдресации,
	             |	СправочникаДокументооборотРолеваяАдресация.ДополнительныйОбъектАдресации
	             |ИЗ
	             |	Справочник.КП_РолеваяАдресация КАК СправочникаДокументооборотРолеваяАдресация
				 |ГДЕ СправочникаДокументооборотРолеваяАдресация.РольИсполнителя<>&ПустаяРоль
				 |";
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура ЗаписатьНастройкиСервером()
	ОбщегоНазначения.ХранилищеОбщихНастроекСохранить("КП_РолеваяАдресация", "РольИсполнителяОтбор", РольИсполнителяОтбор);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ=Истина;
	
	ПараметрыФормы=Новый Структура;
	ПараметрыФормы.Вставить("ТолькоРолеваяАдресация", Истина);
	ПараметрыФормы.Вставить("ПоказыватьПараметрыЗадачи", Ложь);
	ПараметрыФормы.Вставить("ЗаголовокФормы", НСтр("ru='Новый элемент адресации'; en='New addressing element';"));
	
	ОткрытьФорму("ОбщаяФорма.КП_ФормаАдресации", ПараметрыФормы,,,,, Новый ОписаниеОповещения("СписокПередНачаломДобавленияЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавленияЗавершение(СтруктураРезультата, ДополнительныеПараметры) Экспорт
    
    Если СтруктураРезультата=Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Элементы.Список.Обновить();
    
    ТочкаАдресации=СтруктураРезультата.ТочкаАдресации;
    
    //покажем в списке данную точку
    ПерейтиКСтроке(ТочкаАдресации);
    
    Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере 
Функция ПерейтиКСтроке(ТочкаАдресации)
	
	Если ТочкаАдресации.РольИсполнителя<>РольИсполнителяОтбор Тогда
		//снимем отбор
		РольИсполнителяОтбор=Неопределено;
	    УстановитьОтборПоРоли();
		
	КонецЕсли;
	
	Элементы.Список.ТекущаяСтрока=ТочкаАдресации;
	
КонецФункции

#КонецОбласти
